Samsung/TizenRT/os/board/bk7239n/src/components/tfm/tfm/platform/ext/target/beken/armino/driver/io_matrix/gpio_adapter.c
// Copyright 2020-2025 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <common/bk_include.h>
#include <driver/gpio.h>
#include <driver/gpio_types.h>
#include <driver/io_matrix.h>
#include <driver/io_matrix_types.h>

#include "gpio_adapter.h"
#include "gpio_driver.h"
#include "io_matrix_driver.h"
#include "iomx_ll.h"
#if CONFIG_ANA_GPIO
#include "ana_gpio_driver.h"
#endif


#define GPIO_REG_DEFAULT_VALUE                    (0x0)
#define GPIO_WAKE_SOURCE_IDLE_ID                  (GPIO_NUM_MAX)
#define GPIO_LOWPOWER_KEEP_STATUS_IDLE_ID         (GPIO_NUM_MAX)


typedef struct
{
	gpio_id_t id;
	gpio_int_type_t int_type;
	//gpio_isr_t isr;
} gpio_dynamic_wakeup_t;

typedef struct
{
	gpio_id_t gpio_id;
	gpio_config_t config;
} gpio_dynamic_keep_status_t;


static bool s_gpio_is_init = false;

#if CONFIG_GPIO_WAKEUP_SUPPORT
static uint64_t s_gpio_is_setted_wake_status;
static gpio_id_t s_gpio_wakeup_gpio_id = SOC_GPIO_NUM;
#if CONFIG_GPIO_DYNAMIC_WAKEUP_SUPPORT
static gpio_dynamic_wakeup_t s_gpio_dynamic_wakeup_source_map[CONFIG_GPIO_DYNAMIC_WAKEUP_SOURCE_MAX_CNT];
#endif
#endif

#if CONFIG_GPIO_KPSTAT_SUPPORT
static uint64_t s_gpio_is_lowpower_keep_status;
#if CONFIG_GPIO_DYNAMIC_KPSTAT_SUPPORT
static gpio_dynamic_keep_status_t s_gpio_lowpower_keep_config[CONFIG_GPIO_DYNAMIC_KEEP_STATUS_MAX_CNT];
#endif
#endif


#if CONFIG_GPIO_DEFAULT_SET_SUPPORT
static void gpio_default_map_init(void);
#endif

#if CONFIG_GPIO_WAKEUP_SUPPORT
static void gpio_wakeup_source_config(void);
static void gpio_record_wakeup_pin_id(void);
#if CONFIG_GPIO_DYNAMIC_WAKEUP_SUPPORT
static void gpio_dynamic_wakeup_source_init(void);
#endif
#endif

#if CONFIG_GPIO_KPSTAT_SUPPORT
static void gpio_keep_status_init(void);
#if CONFIG_GPIO_DYNAMIC_KPSTAT_SUPPORT
static void gpio_keep_status_config(void);
#endif
#endif


bk_err_t bk_gpio_driver_init(void)
{
	//avoid re-init caused some info lost
	if (s_gpio_is_init) {
		//GPIO_LOGI("%s:has inited \r\n", __func__);
		return BK_OK;
	}

	bk_iomx_driver_init();

#if CONFIG_GPIO_KPSTAT_SUPPORT
	gpio_keep_status_init();
#endif

#if CONFIG_GPIO_WAKEUP_SUPPORT
	gpio_record_wakeup_pin_id();

#if CONFIG_GPIO_DYNAMIC_WAKEUP_SUPPORT
	gpio_dynamic_wakeup_source_init();
#endif

#if CONFIG_ANA_GPIO
	ana_gpio_wakeup_init();
#endif
#endif

#if CONFIG_GPIO_DEFAULT_SET_SUPPORT
	gpio_default_map_init();
#endif

	s_gpio_is_init = true;

#if CONFIG_GPIO_TEST
		int bk_gpio_register_cli_test_feature(void);
		bk_gpio_register_cli_test_feature();
#endif

	return BK_OK;
}

bk_err_t bk_gpio_driver_deinit(void)
{
	if (!s_gpio_is_init)
	{
		//GPIO_LOGI("%s:isn't init \r\n", __func__);
		return BK_OK;
	}

	bk_iomx_driver_deinit();

	s_gpio_is_init = false;

	return BK_OK;
}

void bk_gpio_set_value(gpio_id_t id, uint32_t v)
{
	bk_iomx_set_value(id, v);
}

uint32_t bk_gpio_get_value(gpio_id_t id)
{
	return bk_iomx_get_value(id);
}

bk_err_t bk_gpio_enable_output(gpio_id_t gpio_id)
{
	return bk_iomx_set_gpio_func(gpio_id, FUNC_CODE_OUTPUT);
}

bk_err_t bk_gpio_disable_output(gpio_id_t gpio_id)
{
	// do nothing
	return BK_OK;
}

bk_err_t bk_gpio_enable_input(gpio_id_t gpio_id)
{
	return bk_iomx_set_gpio_func(gpio_id, FUNC_CODE_INPUT);
}

bk_err_t bk_gpio_disable_input(gpio_id_t gpio_id)
{
	// do nothing
	return BK_OK;
}

bk_err_t bk_gpio_enable_pull(gpio_id_t gpio_id )
{
	return bk_iomx_enable_pull(gpio_id);
}

bk_err_t bk_gpio_disable_pull(gpio_id_t gpio_id)
{
	return bk_iomx_disable_pull(gpio_id);
}

bk_err_t bk_gpio_pull_up(gpio_id_t gpio_id)
{
	return bk_iomx_pull_up(gpio_id);
}

bk_err_t bk_gpio_pull_down(gpio_id_t gpio_id)
{
	return bk_iomx_pull_down(gpio_id);
}

bk_err_t bk_gpio_set_output_high(gpio_id_t gpio_id)
{
	return bk_iomx_output_high(gpio_id);
}

bk_err_t bk_gpio_set_output_low(gpio_id_t gpio_id)
{
	return bk_iomx_output_low(gpio_id);
}

bool bk_gpio_get_input(gpio_id_t gpio_id)
{
	return bk_iomx_get_input(gpio_id);
}

//MAX capactiy:3
bool bk_gpio_set_capacity(gpio_id_t gpio_id, uint32 capacity)
{
	return bk_iomx_set_capacity(gpio_id, capacity);
}

bk_err_t bk_gpio_set_config(gpio_id_t gpio_id, const gpio_config_t *config)
{
	switch (config->io_mode) {
	case GPIO_OUTPUT_ENABLE:
		bk_iomx_set_gpio_func(gpio_id, FUNC_CODE_OUTPUT);
		break;

	case GPIO_INPUT_ENABLE:
		bk_iomx_set_gpio_func(gpio_id, FUNC_CODE_INPUT);
		break;

	case GPIO_IO_DISABLE:
		bk_iomx_set_gpio_func(gpio_id, FUNC_CODE_HIGH_Z);
		break;

	default:
		break;
	}

	switch (config->pull_mode) {
	case GPIO_PULL_DISABLE:
		bk_iomx_disable_pull(gpio_id);
		break;

	case GPIO_PULL_DOWN_EN:
		bk_iomx_pull_down(gpio_id);
		break;

	case GPIO_PULL_UP_EN:
		bk_iomx_pull_up(gpio_id);
		break;

	default:
		break;
	}

	return BK_OK;
}

/* Enable GPIO  interrupt.
*/
bk_err_t bk_gpio_register_isr(gpio_id_t gpio_id, gpio_isr_t isr)
{
	return bk_iomx_register_isr(gpio_id, isr);
}

//This function just enable the select GPIO can report IRQ to CPU
bk_err_t bk_gpio_enable_interrupt(gpio_id_t gpio_id)
{
	return bk_iomx_enable_interrupt(gpio_id);
}

bk_err_t bk_gpio_disable_interrupt(gpio_id_t gpio_id)
{
	return bk_iomx_disable_interrupt(gpio_id);
}

bk_err_t bk_gpio_clear_interrupt(gpio_id_t gpio_id)
{
	return bk_iomx_clear_interrupt(gpio_id);
}

bk_err_t bk_gpio_set_interrupt_type(gpio_id_t gpio_id, gpio_int_type_t type)
{
	return bk_iomx_set_interrupt_type(gpio_id, type);
}

IOMX_CODE_T contert_gpio_dev_to_iomx_code(gpio_dev_t dev)
{
	IOMX_CODE_T func_code = FUNC_CODE_INVALID;

	switch (dev)
	{
	case GPIO_DEV_BT_ACTIVE:
		func_code = FUNC_CODE_BT_ACTIVE;
		break;
	case GPIO_DEV_BT_ANT0:
		func_code = FUNC_CODE_BT_ANT_0;
		break;
	case GPIO_DEV_BT_ANT1:
		func_code = FUNC_CODE_BT_ANT_1;
		break;
	case GPIO_DEV_BT_ANT2:
		func_code = FUNC_CODE_BT_ANT_2;
		break;
	case GPIO_DEV_BT_ANT3:
		func_code = FUNC_CODE_BT_ANT_3;
		break;
	case GPIO_DEV_BT_PRIORITY:
		func_code = FUNC_CODE_BT_PRIORITY;
		break;
	case GPIO_DEV_CLK_AUXS:
		func_code = FUNC_CODE_CLK_AUXS;
		break;
	case GPIO_DEV_CLK_XTAL:
		func_code = FUNC_CODE_CLK_XTAL;
		break;
	case GPIO_DEV_CLK_XTAL_DIV:
		func_code = FUNC_CODE_CLK_XTAL_DIV;
		break;
	case GPIO_DEV_DEBUG0:
		func_code = FUNC_CODE_DEBUG_0;
		break;
	case GPIO_DEV_DEBUG1:
		func_code = FUNC_CODE_DEBUG_1;
		break;
	case GPIO_DEV_DEBUG2:
		func_code = FUNC_CODE_DEBUG_2;
		break;
	case GPIO_DEV_DEBUG3:
		func_code = FUNC_CODE_DEBUG_3;
		break;
	case GPIO_DEV_DEBUG4:
		func_code = FUNC_CODE_DEBUG_4;
		break;
	case GPIO_DEV_DEBUG5:
		func_code = FUNC_CODE_DEBUG_5;
		break;
	case GPIO_DEV_DEBUG6:
		func_code = FUNC_CODE_DEBUG_6;
		break;
	case GPIO_DEV_DEBUG7:
		func_code = FUNC_CODE_DEBUG_7;
		break;
	case GPIO_DEV_DEBUG8:
		func_code = FUNC_CODE_DEBUG_8;
		break;
	case GPIO_DEV_DEBUG9:
		func_code = FUNC_CODE_DEBUG_9;
		break;
	case GPIO_DEV_DEBUG10:
		func_code = FUNC_CODE_DEBUG_10;
		break;
	case GPIO_DEV_DEBUG11:
		func_code = FUNC_CODE_DEBUG_11;
		break;
	case GPIO_DEV_DEBUG12:
		func_code = FUNC_CODE_DEBUG_12;
		break;
	case GPIO_DEV_DEBUG13:
		func_code = FUNC_CODE_DEBUG_13;
		break;
	case GPIO_DEV_DEBUG14:
		func_code = FUNC_CODE_DEBUG_14;
		break;
	case GPIO_DEV_DEBUG15:
		func_code = FUNC_CODE_DEBUG_15;
		break;
	case GPIO_DEV_FEM_LNA_EN: // ?
		func_code = FUNC_CODE_DEM_LNA_EN;
		break;
	case GPIO_DEV_I2C0_SCL:
		func_code = FUNC_CODE_I2C0_SCL;
		break;
	case GPIO_DEV_I2C0_SDA:
		func_code = FUNC_CODE_I2C0_SDA;
		break;
	case GPIO_DEV_I2C1_SCL:
		func_code = FUNC_CODE_I2C1_SCL;
		break;
	case GPIO_DEV_I2C1_SDA:
		func_code = FUNC_CODE_I2C1_SDA;
		break;
	case GPIO_DEV_I2S1_MCLK:
		func_code = FUNC_CODE_I2S_MCLK;
		break;
	case GPIO_DEV_I2S1_DIN:
		func_code = FUNC_CODE_I2S0_DIN;
		break;
	case GPIO_DEV_I2S1_DOUT:
		func_code = FUNC_CODE_I2S0_DOUT;
		break;
	case GPIO_DEV_I2S1_CLK:
		func_code = FUNC_CODE_I2S0_SCK;
		break;
	case GPIO_DEV_I2S1_SYNC:
		func_code = FUNC_CODE_I2S0_SYNC;
		break;
	case GPIO_DEV_LEDC:
		func_code = FUNC_CODE_LEDC;
		break;
	case GPIO_DEV_LPO_CLK:
		func_code = FUNC_CODE_LPO_CLK;
		break;
	case GPIO_DEV_PWM0:
		func_code = FUNC_CODE_PWM0_0;
		break;
	case GPIO_DEV_PWM1:
		func_code = FUNC_CODE_PWM0_1;
		break;
	case GPIO_DEV_PWM2:
		func_code = FUNC_CODE_PWM0_2;
		break;
	case GPIO_DEV_PWM3:
		func_code = FUNC_CODE_PWM0_3;
		break;
	case GPIO_DEV_PWM4:
		func_code = FUNC_CODE_PWM0_4;
		break;
	case GPIO_DEV_PWM5:
		func_code = FUNC_CODE_PWM0_5;
		break;
	case GPIO_DEV_PWM6:
		func_code = FUNC_CODE_PWM0_6;
		break;
	case GPIO_DEV_PWM7:
		func_code = FUNC_CODE_PWM0_7;
		break;
	case GPIO_DEV_PWM8:
		func_code = FUNC_CODE_PWM0_8;
		break;
	case GPIO_DEV_PWM9:
		func_code = FUNC_CODE_PWM0_9;
		break;
	case GPIO_DEV_PWM10:
		func_code = FUNC_CODE_PWM0_10;
		break;
	case GPIO_DEV_PWM11:
		func_code = FUNC_CODE_PWM0_11;
		break;
	case GPIO_DEV_QSPI0_CSN:
		func_code = FUNC_CODE_QSPI0_CS;
		break;
	case GPIO_DEV_QSPI0_IO0:
		func_code = FUNC_CODE_QSPI0_DAT_0;
		break;
	case GPIO_DEV_QSPI0_IO1:
		func_code = FUNC_CODE_QSPI0_DAT_1;
		break;
	case GPIO_DEV_QSPI0_IO2:
		func_code = FUNC_CODE_QSPI0_DAT_2;
		break;
	case GPIO_DEV_QSPI0_IO3:
		func_code = FUNC_CODE_QSPI0_DAT_3;
		break;
	case GPIO_DEV_QSPI0_CLK:
		func_code = FUNC_CODE_QSPI0_SCK;
		break;
	case GPIO_DEV_SDIO_HOST_CLK:
		func_code = FUNC_CODE_SDIO_CLK;
		break;
	case GPIO_DEV_SDIO_HOST_CMD:
		func_code = FUNC_CODE_SDIO_CMD;
		break;
	case GPIO_DEV_SDIO_HOST_DATA0:
		func_code = FUNC_CODE_SDIO_DATA_0;
		break;
	case GPIO_DEV_SDIO_HOST_DATA1:
		func_code = FUNC_CODE_SDIO_DATA_1;
		break;
	case GPIO_DEV_SDIO_HOST_DATA2:
		func_code = FUNC_CODE_SDIO_DATA_2;
		break;
	case GPIO_DEV_SDIO_HOST_DATA3:
		func_code = FUNC_CODE_SDIO_DATA_3;
		break;
	case GPIO_DEV_SPI0_MISO:
		func_code = FUNC_CODE_SPI0_MISO;
		break;
	case GPIO_DEV_SPI0_MOSI:
		func_code = FUNC_CODE_SPI0_MOSI;
		break;
	case GPIO_DEV_SPI0_CSN:
		func_code = FUNC_CODE_SPI0_NSS;
		break;
	case GPIO_DEV_SPI0_SCK:
		func_code = FUNC_CODE_SPI0_SCK;
		break;
	case GPIO_DEV_SPI1_MISO:
		func_code = FUNC_CODE_SPI1_MISO;
		break;
	case GPIO_DEV_SPI1_MOSI:
		func_code = FUNC_CODE_SPI1_MOSI;
		break;
	case GPIO_DEV_SPI1_CSN:
		func_code = FUNC_CODE_SPI1_NSS;
		break;
	case GPIO_DEV_SPI1_SCK:
		func_code = FUNC_CODE_SPI1_SCK;
		break;
	case GPIO_DEV_SW_CLK:
		func_code = FUNC_CODE_SWCLK;
		break;
	case GPIO_DEV_SWD_IO:
		func_code = FUNC_CODE_SWDIO;
		break;
	case GPIO_DEV_TAMP_RX_I:
		func_code = FUNC_CODE_TAMP_RX;
		break;
	case GPIO_DEV_TAMP_TX_O:
		func_code = FUNC_CODE_TAMP_TX;
		break;
	case GPIO_DEV_UART1_CTS:
		func_code = FUNC_CODE_UART0_CTS;
		break;
	case GPIO_DEV_UART1_RTS:
		func_code = FUNC_CODE_UART0_RTS;
		break;
	case GPIO_DEV_UART1_RXD:
		func_code = FUNC_CODE_UART0_RXD;
		break;
	case GPIO_DEV_UART1_TXD:
		func_code = FUNC_CODE_UART0_TXD;
		break;
	case GPIO_DEV_UART2_RXD:
		func_code = FUNC_CODE_UART1_RXD;
		break;
	case GPIO_DEV_UART2_TXD:
		func_code = FUNC_CODE_UART1_TXD;
		break;
	case GPIO_DEV_UART3_RXD:
		func_code = FUNC_CODE_UART2_RXD;
		break;
	case GPIO_DEV_UART3_TXD:
		func_code = FUNC_CODE_UART2_TXD;
		break;
	case GPIO_DEV_UART4_CTS:
		func_code = FUNC_CODE_UART3_CTS;
		break;
	case GPIO_DEV_UART4_RTS:
		func_code = FUNC_CODE_UART3_RTS;
		break;
	case GPIO_DEV_UART4_RXD:
		func_code = FUNC_CODE_UART3_RXD;
		break;
	case GPIO_DEV_UART4_TXD:
		func_code = FUNC_CODE_UART3_TXD;
		break;
	case GPIO_DEV_WIFI_ACTIVE:
		func_code = FUNC_CODE_WIFI_ACTIVE;
		break;
	case GPIO_DEV_WIFI_TX_EN:
		func_code = FUNC_CODE_WIFI_RX_EN;
		break;
	case GPIO_DEV_WIFI_RX_EN:
		func_code = FUNC_CODE_WIFI_TX_EN;
		break;

	default:
		break;
	}

	return func_code;
}

