Samsung/TizenRT/os/board/bk7239n/src/components/tfm/tfm/platform/ext/target/beken/armino/driver/io_matrix/gpio_adapter.c
static void gpio_low_power_config(void);
bk_err_t gpio_enter_low_power(void *param)
{
	//////GPIO_LOGD("%s[+]\r\n", __func__);

	iomx_dump_regs(true, true, true);

	iomx_backup_gpio_configs();

	iomx_dump_baked_regs();

	//NOTES:force disable all int to avoid config gpio caused error isr
	iomx_disable_all_interrupts();

	// setup gpio configs for sleep
#if CONFIG_GPIO_DYNAMIC_KPSTAT_SUPPORT
	gpio_keep_status_config();
#endif

#if CONFIG_GPIO_WAKEUP_SUPPORT
	gpio_wakeup_source_config();
#endif

	gpio_low_power_config();

	iomx_dump_regs(true, true, true);

	////GPIO_LOGD("%s[-]\r\n", __func__);

	return BK_OK;
}

bk_err_t gpio_exit_low_power(void *param)
{
	////GPIO_LOGD("%s[+]\r\n", __func__);

	iomx_dump_regs(true, true, true);
	iomx_dump_baked_regs();

	iomx_disable_all_interrupts();

#if CONFIG_GPIO_WAKEUP_SUPPORT
#if CONFIG_ANA_GPIO
	// another workaround fix for unexpected gpio interrupt
	ana_gpio_clear_wakeup_source();
#endif
#endif

	iomx_restore_gpio_configs();

	iomx_dump_regs(true, true, true);
	iomx_dump_baked_regs();

	////GPIO_LOGD("%s[-]\r\n", __func__);

	return BK_OK;
}

bk_err_t gpio_hal_switch_to_low_power_status(uint64_t skip_io)
{
	for (gpio_id_t i = GPIO_0; i < GPIO_NUM_MAX; i++)
	{
		if (skip_io & (0x1ULL << i))
			continue;
		bk_iomx_set_value(i, GPIO_REG_DEFAULT_VALUE);
	}

	return BK_OK;
}

static void gpio_low_power_config(void)
{
	uint64_t skip_io = 0;
	
#if CONFIG_GPIO_WAKEUP_SUPPORT
	skip_io |= s_gpio_is_setted_wake_status;
#endif

#if CONFIG_GPIO_KPSTAT_SUPPORT
	skip_io |= s_gpio_is_lowpower_keep_status;
#endif

	gpio_hal_switch_to_low_power_status(skip_io);
}

#if CONFIG_GPIO_WAKEUP_SUPPORT
gpio_id_t bk_gpio_get_wakeup_gpio_id(void)
{
	return s_gpio_wakeup_gpio_id;
}

static void gpio_record_wakeup_pin_id(void)
{
#if CONFIG_ANA_GPIO
	s_gpio_wakeup_gpio_id = ana_gpio_get_wakeup_pin();
#endif
}

bk_err_t gpio_enable_interrupt_mult_for_wake(void)
{
#if CONFIG_ANA_GPIO
	ana_gpio_config_wakeup_source(s_gpio_is_setted_wake_status);
#endif

	return iomx_enable_multi_interrupts(s_gpio_is_setted_wake_status);
}

static void gpio_set_wakeup_config(gpio_id_t gpio_id, gpio_int_type_t int_type)
{
	// setup gpio as input mode
	bk_iomx_set_value(gpio_id, GPIO_REG_DEFAULT_VALUE);
	bk_iomx_set_gpio_func(gpio_id, FUNC_CODE_INPUT);

	switch(int_type)
	{
		case GPIO_INT_TYPE_LOW_LEVEL:
		case GPIO_INT_TYPE_FALLING_EDGE:
			bk_gpio_pull_up(gpio_id);
			//GPIO_LOGD("%s GPIO %d Pull_up!\r\n", __func__, gpio_id);
			break;
		case GPIO_INT_TYPE_HIGH_LEVEL:
		case GPIO_INT_TYPE_RISING_EDGE:
			bk_gpio_pull_down(gpio_id);
			//GPIO_LOGD("%s GPIO %d Pull_down!\r\n", __func__, gpio_id);
			break;
		default:
			//GPIO_LOGI("%s Please set fill in the mode correctly!\r\n", __func__);
			break;
	}

	bk_gpio_set_interrupt_type(gpio_id, int_type);
}

static void gpio_wakeup_source_config(void)
{
	uint32_t i = 0;

	//GPIO_LOGD("%s[+]\r\n", __func__);

	s_gpio_is_setted_wake_status = 0;

	gpio_wakeup_t gpio_wakeup_map[] = GPIO_STATIC_WAKEUP_SOURCE_MAP;
	for (i = 0; i < sizeof(gpio_wakeup_map)/sizeof(gpio_wakeup_t); i++)
	{
		gpio_set_wakeup_config(gpio_wakeup_map[i].id, gpio_wakeup_map[i].int_type);
		s_gpio_is_setted_wake_status |= ((uint64_t)1 << gpio_wakeup_map[i].id);
	}

#if CONFIG_GPIO_DYNAMIC_WAKEUP_SUPPORT
	for (i = 0; i < CONFIG_GPIO_DYNAMIC_WAKEUP_SOURCE_MAX_CNT; i++)
	{
		if (s_gpio_dynamic_wakeup_source_map[i].id != GPIO_WAKE_SOURCE_IDLE_ID) {
			//maybe the PIN is re-used as SECOND_FUNCTION and GPIO,F.E:UART RXD re-uses as wakeup PIN
			gpio_set_wakeup_config(s_gpio_dynamic_wakeup_source_map[i].id, s_gpio_dynamic_wakeup_source_map[i].int_type);
			s_gpio_is_setted_wake_status |= ((uint64_t)1 << s_gpio_dynamic_wakeup_source_map[i].id);
		}
	}
#endif

	//GPIO_LOGD("%s[-]set wake src h=0x%0x, l=0x%0x\r\n", __func__, (uint32_t)(s_gpio_is_setted_wake_status>>32), (uint32_t)s_gpio_is_setted_wake_status);
}

#if CONFIG_GPIO_DYNAMIC_WAKEUP_SUPPORT
bk_err_t bk_gpio_register_wakeup_source(gpio_id_t gpio_id, gpio_int_type_t int_type)
{
	uint32_t i = 0;

	// GPIO_RETURN_ON_INVALID_ID(gpio_id);
	// GPIO_RETURN_ON_INVALID_INT_TYPE_MODE(int_type);

	//search the same id and replace it.
	for (i = 0; i < CONFIG_GPIO_DYNAMIC_WAKEUP_SOURCE_MAX_CNT; i++)
	{
		if (s_gpio_dynamic_wakeup_source_map[i].id == gpio_id)
		{
			s_gpio_dynamic_wakeup_source_map[i].int_type = int_type;

			//NOTES:If doesn't set int type, exit lowpower, if the ISR has reported by rising/falling type
			//Then restore to level type, entry GPIO ISR caused the int status lost.
			bk_gpio_set_interrupt_type(gpio_id, int_type);
			//s_gpio_dynamic_wakeup_source_map[i].isr = isr;

			//GPIO_LOGD("gpio=%d,int_type=%d replace previous wake src\r\n", gpio_id, int_type);
			return BK_OK;
		}
	}

	//serach the first idle id
	for (i = 0; i < CONFIG_GPIO_DYNAMIC_WAKEUP_SOURCE_MAX_CNT; i++)
	{
		if (s_gpio_dynamic_wakeup_source_map[i].id == GPIO_WAKE_SOURCE_IDLE_ID)
		{
			s_gpio_dynamic_wakeup_source_map[i].id = gpio_id;
			s_gpio_dynamic_wakeup_source_map[i].int_type = int_type;

			//NOTES:If doesn't set int type, exit lowpower, if the ISR has reported by rising/falling type
			//Then restore to level type, entry GPIO ISR caused the int status lost.
			bk_gpio_set_interrupt_type(gpio_id, int_type);
			//s_gpio_dynamic_wakeup_source_map[i].isr = isr;
			s_gpio_is_setted_wake_status |= ((uint64_t)1 << s_gpio_dynamic_wakeup_source_map[i].id);

			//GPIO_LOGD("gpio=%d,int_type=%d register wake src\r\n", gpio_id, int_type);

			return BK_OK;
		}
	}

	////GPIO_LOGE("too much(%d) GPIO is setted wake src\r\n", CONFIG_GPIO_DYNAMIC_WAKEUP_SOURCE_MAX_CNT);
	for (i = 0; i < CONFIG_GPIO_DYNAMIC_WAKEUP_SOURCE_MAX_CNT; i++)
	{
		//GPIO_LOGE("gpio id:%d is using \r\n", s_gpio_dynamic_wakeup_source_map[i].id);
	}
	return BK_FAIL;
}

bk_err_t bk_gpio_unregister_wakeup_source(gpio_id_t gpio_id)
{
	uint32_t i = 0;

	// GPIO_RETURN_ON_INVALID_ID(gpio_id);

	/* search the same id and replace it.*/
	for (i = 0; i < CONFIG_GPIO_DYNAMIC_WAKEUP_SOURCE_MAX_CNT; i++)
	{
		if (s_gpio_dynamic_wakeup_source_map[i].id == gpio_id)
		{
			s_gpio_dynamic_wakeup_source_map[i].id = GPIO_WAKE_SOURCE_IDLE_ID;
			s_gpio_dynamic_wakeup_source_map[i].int_type = GPIO_INT_TYPE_MAX;
			//s_gpio_dynamic_wakeup_source_map[i].isr = NULL;
			s_gpio_is_setted_wake_status &= ~(((uint64_t)1 << s_gpio_dynamic_wakeup_source_map[i].id));

			/* Clear the hardware status during deregister */
			bk_gpio_disable_input(gpio_id);
			bk_gpio_disable_interrupt(gpio_id);

			//GPIO_LOGD("%s[-]gpioid=%d\r\n", __func__, gpio_id);

			return BK_OK;
		}
	}

