Samsung/TizenRT/os/board/bk7239n/src/components/tfm/tfm/platform/ext/target/beken/armino/driver/io_matrix/gpio_adapter.c
		//function mode
		if (default_map[i].second_func_en) {
			code = contert_gpio_dev_to_iomx_code(default_map[i].second_func_dev);
			bk_iomx_set_gpio_func(gpio_id, code);
		}

		//low power
		if (default_map[i].low_power_io_ctrl == GPIO_LOW_POWER_KEEP_OUTPUT_STATUS)
			bk_iomx_set_gpio_func(gpio_id, FUNC_CODE_OUTPUT);
		else if (default_map[i].low_power_io_ctrl == GPIO_LOW_POWER_KEEP_INPUT_STATUS)
			bk_iomx_set_gpio_func(gpio_id, FUNC_CODE_INPUT);

		//io mode
		switch(default_map[i].io_mode)
		{
			case GPIO_IO_DISABLE:
				bk_iomx_set_gpio_func(gpio_id, FUNC_CODE_HIGH_Z);
				break;
			case GPIO_OUTPUT_ENABLE:
				//NOTES:special combine use it with pull mode
				if (default_map[i].pull_mode == GPIO_PULL_DOWN_EN)
					bk_iomx_output_low(gpio_id);
				if (default_map[i].pull_mode == GPIO_PULL_UP_EN)
					bk_iomx_output_high(gpio_id);
				break;
			case GPIO_INPUT_ENABLE:
				bk_iomx_set_gpio_func(gpio_id, FUNC_CODE_INPUT);
				break;
			default:
				break;
		}

		//pull mode
		switch(default_map[i].pull_mode)
		{
			case GPIO_PULL_DISABLE:
				bk_iomx_disable_pull(gpio_id);
				break;
			case GPIO_PULL_DOWN_EN:
				bk_iomx_pull_down(gpio_id);
				break;
			case GPIO_PULL_UP_EN:
				bk_iomx_pull_up(gpio_id);
				break;
			default:
				break;
		}

		//interrupt
		if (default_map[i].int_en) {
			bk_iomx_set_interrupt_type(gpio_id, default_map[i].int_type);

			for (volatile int j = 0; j < 1000; j++);    //Before enable the interrupt,wait for the internal stability of the chip
			bk_iomx_enable_interrupt(gpio_id);
		}

		bk_iomx_clear_interrupt(gpio_id);

		//driver_capacity
		bk_iomx_set_capacity(gpio_id, default_map[i].driver_capacity);
	}
}
#endif